DataProcessors/ТипПрофиля_ОбновлениеКонфигурацииБД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ТипПрофиля_ОбновлениеКонфигурацииБД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьК1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыПараметров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыПараметров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логин</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пароль</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ТипПрофиля_ОбновлениеКонфигурацииБД/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьСценарий() Экспорт
	
	ОбновитьКонфигурациюБазыДанных(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ);
	
КонецПроцедуры

Функция ТипПараметра(ИмяПараметра) Экспорт
	Типы = Перечисления.ТипыПараметров;
	Если ИмяПараметра = "ПутьК1С" Тогда
		Возврат Типы.Файл;
	ИначеЕсли ИмяПараметра = "КаталогИБ" Тогда
		Возврат Типы.Каталог;
	ИначеЕсли ИмяПараметра = "ПользовательИБ" Тогда
		Возврат Типы.Логин;
	ИначеЕсли ИмяПараметра = "ПарольИБ" Тогда
		Возврат Типы.Пароль;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьКонфигурациюБазыДанных(ПутьК1С, КаталогИБ, ПользовательИБ, ПарольИБ)
	Команда = "%ПутьК1С%   DESIGNER   %КаталогИБ% /N %ПользовательИБ% /P %ПарольИБ% "
		+"  /UpdateDBCfg ";
		
	Команда = СтрЗаменить(Команда, "%ПутьК1С%", ПутьК1С);
	
	Команда = СтрЗаменить(Команда, "%КаталогИБ%", КаталогИБ);
	Команда = СтрЗаменить(Команда, "%ПользовательИБ%", ПользовательИБ);
	Команда = СтрЗаменить(Команда, "%ПарольИБ%", ПарольИБ);
	
	ПакетныйРежим.ВыполнитьИзКоманднойСтроки(Команда);
		
КонецПроцедуры


#КонецОбласти
